chameleon/cmake_modules/morse_cmake/modules/find/morse_cmakefind_doc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-11 ven. 10:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MORSE CMake "Find modules" documentation</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Florent Pruvost" />
<link rel="stylesheet" title="Standard" href="css/worg.css" type="text/css" />
<link rel="stylesheet" type="text/css" href="css/VisuGen.css" />
<link rel="stylesheet" type="text/css" href="css/VisuRubriqueEncadre.css" />
</head>
<body>
<div id="content">
<h1 class="title">MORSE CMake "Find modules" documentation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6a1d49d">1. CMake find modules: what is it, why is it useful?</a></li>
<li><a href="#orgc79c433">2. How CMake is aware of these specific modules?</a></li>
<li><a href="#orgd94103a">3. Internal mechanism: what a "find" mainly do, what are the paths scanned?</a>
<ul>
<li><a href="#org5ee891c">3.1. How to act on the searching process?</a></li>
<li><a href="#org9523cf0">3.2. A version of the library is found but I want another one, how to change?</a></li>
</ul>
</li>
<li><a href="#org6d52417">4. How to get more information about a specific module usage?</a></li>
<li><a href="#org4cffe2e">5. Choose a specific BLAS/LAPACK</a></li>
<li><a href="#org9c82006">6. Hint for Intel MKL</a></li>
<li><a href="#org9f1f26c">7. To prefer static libraries if both static and dynamic are available</a></li>
</ul>
</div>
</div>
<p>
This document aims at documenting MORSE find_package CMake modules
which allow to detect library dependencies on UNIX systems (mainly
Linux and MAC OS X). These additional modules have been written
because either, they are not distributed by the CMake community, or,
they already exist but some are outdated or miss the requirements we
need. The modules correspond to packages that do not fully rely on
CMake or which do not provide a "PACKAGE"Config.cmake file. Ideally
these modules should not exist and packages should be compliant with
CMake by providing the cmake config file installed in
<code>&lt;prefix&gt;/lib/cmake/&lt;package&gt;/...</code>.
</p>

<div id="outline-container-org6a1d49d" class="outline-2">
<h2 id="org6a1d49d"><span class="section-number-2">1</span> CMake find modules: what is it, why is it useful?</h2>
<div class="outline-text-2" id="text-1">
<p>
The CMake modules being here can be used to "find" some installed
libraries on the system through the invocation of the <code>find_package</code>
CMake command ("MODULE" mode signature, cf. CMake documentation of
<code>find_package</code> command)
</p>
<pre class="example">
find_package(STARPU) # look for STARPU libraries and compiler/linker flags
add_executable(foo ${FOO_SOURCES}) # define an executable from sources
target_link_libraries(foo PRIVATE MORSE::STARPU) # add STARPU libraries for the link
# target_link_libraries(foo ${STARPU_LIBRARIES}) old school cmake with variables and not target
</pre>

<p>
It allows to find efficiently the libraries we depend on.  The modules
are generally written by the library developers or very active users
so that they know very well how the library is built how it is
installed, etc.
</p>

<p>
The <code>find_package(FOO)</code> command looks for the library(ies), the header
directory(ies) and compiler/linker flags. If found the following
CMake variables are set:
</p>
<ul class="org-ul">
<li>FOO_FOUND: set if package is found</li>
<li>FOO_PREFIX: root of the package installation (usually one
directory above lib/ one)</li>
<li>FOO_VERSION: version of the package if found with pkg-config</li>
<li>FOO_INCLUDE_DIRS: path to headers</li>
<li>FOO_LIBRARY_DIRS: library directories</li>
<li>FOO_LIBRARIES: list of libraries necessary to link with the
package (absolute paths given)</li>
<li>FOO_CFLAGS_OTHER: required compiler flags</li>
<li>FOO_LDLAGS_OTHER: required linker flags</li>
<li>FOO_STATIC: to force using static libraries when exist or is set
to 1 if the only library found is static</li>
</ul>

<p>
In addition the <i>find_package</i> command define an imported target
<b>MORSE::FOO</b> to be used in modern CMake fashion. The target defines
the following CMake properties:
</p>
<ul class="org-ul">
<li>INTERFACE_INCLUDE_DIRECTORIES</li>
<li>INTERFACE_LINK_DIRECTORIES</li>
<li>INTERFACE_LINK_LIBRARIES</li>
<li>INTERFACE_COMPILE_OPTIONS</li>
<li>INTERFACE_LINK_OPTIONS</li>
</ul>
</div>
</div>
<div id="outline-container-orgc79c433" class="outline-2">
<h2 id="orgc79c433"><span class="section-number-2">2</span> How CMake is aware of these specific modules?</h2>
<div class="outline-text-2" id="text-2">
<p>
To use MORSE modules you should call the <b>MorseInit</b> module as follows:
</p>
<pre class="example">
# For example if Morse CMake modules are located in ./cmake_modules/morse_cmake
# append this directory to the list of directories containing CMake modules
list(APPEND CMAKE_MODULE_PATH "${CMAKE_SOURCE_DIR}/cmake_modules/morse_cmake/modules" )
# Include the init module
include(MorseInit)
</pre>
</div>
</div>
<div id="outline-container-orgd94103a" class="outline-2">
<h2 id="orgd94103a"><span class="section-number-2">3</span> Internal mechanism: what a "find" mainly do, what are the paths scanned?</h2>
<div class="outline-text-2" id="text-3">
<p>
We try to enforce using pkg-config file if provided (update your
PKG_CONFIG_PATH environment variable).
</p>

<p>
List of packages relying only on pkg-config file: EZTRACE, FXT, GTG,
HWLOC, PAPI, SIMGRID, PARSEC, STARPU.
</p>

<p>
For packages which do not provide any pkg-config file the general
process consists in looking into some system paths known from CMake to
find headers and libraries and define in output some CMake variables
the user need to link with his dependency. Additionaly to the system
paths, some environment variable can also be scanned like <code>LIBRARY_PATH</code>
<code>LD_LIBRARY_PATH</code> and <code>CPATH</code>. A custom CMake cache variable <code>LIBNAME_DIR</code>
is also introduced in our modules in order to let users indicate
directly during the "configure" step a specific installation directory
for the library (e.g. where are located the include/, lib/, etc,
sub-directories). The priority order is the following:
</p>
<ol class="org-ol">
<li>The CMake variable <code>LIBNAME_DIR</code> is set or both <code>LIBNAME_INCDIR</code> and
<code>LIBNAME_LIBDIR</code> are set</li>
<li>The environment variable <code>LIBNAME_DIR</code> is set or both <code>LIBNAME_INCDIR</code> and
<code>LIBNAME_LIBDIR</code></li>
<li>A pkg-config .pc file (hwloc.pc) of the library is available in the
environment (cf. PKG_CONFIG_PATH environment variable) and is used</li>
<li><p>
Look into the following paths
a) for headers:
</p>
<ul class="org-ul">
<li>scan the paths present in the following environment variables
<code>INCLUDE</code>, <code>C_INCLUDE_PATH</code>, <code>CPATH</code>, <code>INCLUDE_PATH</code></li>
<li>scan the system paths for headers: look into path present in
the CMake variable <code>CMAKE_C_IMPLICIT_INCLUDE_DIRECTORIES</code></li>
</ul>
<p>
b) for libraries:
</p>
<ul class="org-ul">
<li>scan the paths present in the following environment variables
<code>LIBRARY_PATH</code>, <code>LIB</code> (Windows), <code>DYLD_LIBRARY_PATH</code> (Mac OS X),
<code>LD_LIBRARY_PATH</code> (Linux)</li>
<li>scan the system paths for headers: look into path present in
the CMake variable <code>CMAKE_C_IMPLICIT_LINK_DIRECTORIES</code></li>
</ul></li>
</ol>

<p>
When it is possible, compiler flags are also given to users. This last
point suggest that the information can be found in the library
installation, e.g. through a pkg-config file.
</p>

<p>
In some cases, the library can be searched for a specific
configuration, e.g "I want to find an installation of this library
coming with all these components enabled" such as: MUMPS linear solver
must be able to use SCOTCH graph partitioner. See the "COMPONENTS"
option of the <code>find_package</code> command and look for the header of the
module file to get more information about possible components.
</p>

<p>
Once some header files and libraries have been found the module tries
to call a basic function of the library to test the link step. During
this process, the CMake <code>check_function_exists</code> is used. If the test
fails a message is given with the compiler and linker flags used
during the test. The precise error can also be found in the
<code>CMakeFiles/CMakeError.log</code> file of the build directory.
</p>
</div>

<div id="outline-container-org5ee891c" class="outline-3">
<h3 id="org5ee891c"><span class="section-number-3">3.1</span> How to act on the searching process?</h3>
<div class="outline-text-3" id="text-3-1">
<p>
If the user does not change the environment (do not modify
environment variables like <code>LIBRARY_PATH</code>, <code>LD_LIBRARY_PATH</code>), and
gives no hint at all about the location of the libraries, the
module will match the situation 4.2 and will look into system
paths.
</p>

<p>
To give an "exotic" locations, i.e. not in system paths, the user
can use scripts or a <code>module</code> like system to set the paths in
environment variables (<code>LD_LIBRARY_PATH</code>, <code>INCLUDE</code>, &#x2026;),
cf. situation 4.1 and 2.
</p>

<p>
For some libraries it is possible to rely on <code>pkg-config</code> if the .pc
file path is in the <code>PKG_CONFIG_PATH</code> environment variable,
cf. situation 3.
</p>

<p>
Finally, to directly give "by hand" the path, the user can set a
CMake variable <code>LIBNAME_DIR</code>, or the pair <code>LIBNAME_INCDIR</code> and
<code>LIBNAME_LIBDIR</code>, cf. situation 1.
</p>
</div>
</div>
<div id="outline-container-org9523cf0" class="outline-3">
<h3 id="org9523cf0"><span class="section-number-3">3.2</span> A version of the library is found but I want another one, how to change?</h3>
<div class="outline-text-3" id="text-3-2">
<p>
If a first configuration has found a library somewhere but you are not
satisfied with this one and want to give some hints to look for it:
</p>
<ul class="org-ul">
<li>update your environment or give the location "by hand" (<code>LIBNAME_DIR</code>)</li>
<li>delete the CMake cache file to make it "forget" the libraries
already found: <code>rm CMakeCache.txt</code></li>
<li>configure again: <code>cmake path/to/your/CMakeLists.txt ...</code></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6d52417" class="outline-2">
<h2 id="org6d52417"><span class="section-number-2">4</span> How to get more information about a specific module usage?</h2>
<div class="outline-text-2" id="text-4">
<p>
Specific information about a precise Find module are given directly
at the head of the module file. The usage, the optional parameters
that can be used and the output variables are explained here.
</p>
</div>
</div>
<div id="outline-container-org4cffe2e" class="outline-2">
<h2 id="org4cffe2e"><span class="section-number-2">5</span> Choose a specific BLAS/LAPACK</h2>
<div class="outline-text-2" id="text-5">
<p>
 See <code>cmake --help-module FindBLAS</code> or <code>cmake --help-module FindLAPACK</code>
to get all available BLA_VENDOR.
</p>
</div>
</div>
<div id="outline-container-org9c82006" class="outline-2">
<h2 id="org9c82006"><span class="section-number-2">6</span> Hint for Intel MKL</h2>
<div class="outline-text-2" id="text-6">
<p>
To look for the Intel MKL BLAS, LAPACK (or CBLAS, LAPACKE), one can
enforce Intel MKL search with the CMake variable <b>BLA_VENDOR</b> as it is
documented in BLAS and LAPACK officiel modules <code>cmake --help-module
  FindLAPACK</code>
</p>
<pre class="example">
# for sequential blas/lapack
cmake .. -DBLA_VENDOR=Intel10_64lp_seq
# for multithreaded blas/lapack
cmake .. -DBLA_VENDOR=Intel10_64lp
# play with MKL_NUM_THREADS env. var. to set number of threads used internally
</pre>
<p>
or set BLA_VENDOR directly in your CMake files.
</p>
</div>
</div>
<div id="outline-container-org9f1f26c" class="outline-2">
<h2 id="org9f1f26c"><span class="section-number-2">7</span> To prefer static libraries if both static and dynamic are available</h2>
<div class="outline-text-2" id="text-7">
<p>
Set "PACKAGE"_STATIC=1 at cmake configure. For BLAS/LAPACK/SCALAPACK
use <b>BLA_STATIC=1</b>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Florent Pruvost</p>
<p class="date">Created: 2020-12-11 ven. 10:34</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
